// Необходимо написать программу, которая будет принимать текст от пользователя и делать над ним определённые действия.
// Функциональные требования:
// Программа принимает от пользователя минимум 100 символов
// Подсчёт количества слов в тексте
// Поиск самого короткого слова
// Подсчёт количества предложений
// Подсчёт количества гласных и согласных букв
// Поиск самого длинного слова
// Создание статистики по частоте встречаемости каждой буквы
// Возможность продолжить работу с новым текстом
// Сохранение всей статистики в список 
// Возможность вывести статистику по прошлым текстам

class textResult
{
    public string Text;
    public int Words;
    public string Shortest;
    public string Longest;
    public int Sentences;
    public int Vowels;
    public int Consonants;
    public Dictionary<char, int> Letters = new Dictionary<char, int>();
}
