// Необходимо написать программу, которая будет принимать текст от пользователя и делать над ним определённые действия.
// Функциональные требования:
// Программа принимает от пользователя минимум 100 символов
// Подсчёт количества слов в тексте
// Поиск самого короткого слова
// Подсчёт количества предложений
// Подсчёт количества гласных и согласных букв
// Поиск самого длинного слова
// Создание статистики по частоте встречаемости каждой буквы
// Возможность продолжить работу с новым текстом
// Сохранение всей статистики в список 
// Возможность вывести статистику по прошлым текстам

class stats
{
    public void text()
    {
        string text1 = Console.ReadLine() ?? "";
        text1.ToLowerInvariant();
        int words = 1;
        if (text1.Length >= 100)
        {
            for (int i = 0; i < text1.Length; i++)
            {
                if (text1[i] == ' ' && text1[i + 1] != ' ')
                {
                    words++;
                    
                }
                
                
            }
            
        }
        else
        {
            Console.WriteLine("You need to enter a number between higher than a 100");
        }
    }
}